export const skill_division: Record<number, string> = {
  1: "Жауынгер",
  2: "Сарбаз",
  3: "Шаруа",
  4: "Бай",
  5: "Ауылбасы",
  6: "Аксакал",
  7: "Рубасы",
  8: "Би",
  9: "Султан",
  10: "Хан",
};

export const tasks = [
  {
    id: 1,
    text: "Чтение академических текстов",
    description:
      "Каждое чтение сопровождается вопросами для самопроверки понимания прочитанного. 2 текста.",
    badgeStatus: "Не начато",
    skillRequired: "Навык чтения",
  },
  {
    id: 2,
    text: "Грамматика",
    description: "Тесты на знание грамматики казахского языка. 2 теста.",
    badgeStatus: "Завершено",
    skillRequired: "Грамматика",
  },
  {
    id: 3,
    text: "Словарный запас",
    description: "Тесты на знание словарного запаса казахского языка. 2 теста.",
    badgeStatus: "В процессе",
    skillRequired: "Словарный запас",
  },
];
